build/testCase/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  v2312                                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    Interface_1_airZone
    {
        type            cyclicAMI;
        value           $internalField;
    }

    Interface_1_bladeZone
    {
        type            cyclicAMI;
        value           $internalField;
    }

    airZone_outlet
    {
        type            calculated;
        value           uniform 0;
    }

    bladeZone_blade
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }
}

// ************************************************************************* //
