build/testCase/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  v2312                                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh   dynamicMotionSolverFvMesh;

motionSolverLibs ("libfvMotionSolvers.so");

motionSolver    solidBody;

solidBodyMotionFunction rotatingMotion;

cellZone        bladeZone;  // Zone that rotates (from CGNS)

rotatingMotionCoeffs
{
    origin      (0 0 0);           // Rotation center
    axis        (0 0 1);           // Rotation axis (z-axis)
    omega       100;               // Angular velocity [rad/s]
}

// ************************************************************************* //
